# Practice Case - Coding Python
## By : Kurnia Aditia
### *Data Fellowship Program Batch 6*

### Question 1
Using Dataset A above, The table given to you cannot be updated, so if there is a change in the status of a transaction the new data is inserted instead of updating the status of the transaction, it will insert a new row with the same id and insert time based on the time when the row is inserted. You are assigned to create a view that only shows the most updated transactions for each id, so there is no duplicate id inside the view.

#### Import Library

In [1]:
import sqlite3
import pandas as pd

#### Create Function

In [14]:
def db_query(record,query,filename):
    conn=sqlite3.connect(filename) ##create connection to database and 
    c = conn.cursor()
    c.execute('''CREATE TABLE transactions
                   (id INTEGER, insert_time DATETIME, tx_amout FLOAT, tx_type TEXT, status TEXT)''') ## create table schema
    c.executemany("INSERT INTO transactions VALUES (?,?,?,?,?)",record) #insert record to table
    print('Success create database')
    c.execute(query)
    print('Query success')
    items=c.fetchall()
    for item in items:
        print (item)
    conn.close()

#### Execute Query Function

In [15]:
query='SELECT * FROM transactions GROUP BY id HAVING insert_time==MAX(insert_time)'
trans_record=[(1,'2021-06-20 10:11:01',100,'buy','open'),(1,'2021-06-20 12:15:07',50,'sell','close'),
             (2,'2021-06-25 11:12:21',150,'sell','open'),(2,'2021-06-25 14:14:37',250,'buy','close'),
             (3,'2021-06-22 13:22:51',200,'buy','open'),(3,'2021-06-22 18:44:57',350,'sell','close'),
             (3,'2021-06-23 10:15:31',50,'buy','open'),(4,'2021-06-30 08:05:35',250,'sell','open'),
             (4,'2021-06-30 21:09:45',300,'buy','close')]

db_query(trans_record,query,'test_query.db')

Success create database
Query success
(1, '2021-06-20 12:15:07', 50.0, 'sell', 'close')
(2, '2021-06-25 14:14:37', 250.0, 'buy', 'close')
(3, '2021-06-23 10:15:31', 50.0, 'buy', 'open')
(4, '2021-06-30 21:09:45', 300.0, 'buy', 'close')

### Question 2
Using Dataset B above, Write a query to get the rolling sum total of sales using the window function!

In [24]:
def db_query_sum(record,query,filename):
    conn=sqlite3.connect(filename) ##create connection to database and 
    c = conn.cursor()
    c.execute('''CREATE TABLE sales
                   (Date DATE, Sales FLOAT)''') ## create table schema
    c.executemany("INSERT INTO sales VALUES (?,?)",record) #insert record to table
    print('Success create database')
    c.execute(query)
    print('Query success')
    items=c.fetchall()
    for item in items:
        print (item)
    conn.close()

In [26]:
sales_record=[('2021-01-01',100),('2021-01-02',34),('2021-01-02',123),('2021-01-02',134),
             ('2021-01-03',145),('2021-01-03',24),('2021-01-04',541),('2021-01-04',636),
             ('2021-01-05',322),('2021-01-06',242),('2021-01-07',22),('2021-01-08',46)]
query_sum='SELECT Date,SUM(Sales) FROM sales GROUP BY Date'
db_query_sum(sales_record,query_sum,'test_query_sales.db')

Success create database
Query success
('2021-01-01', 100.0)
('2021-01-02', 291.0)
('2021-01-03', 169.0)
('2021-01-04', 1177.0)
('2021-01-05', 322.0)
('2021-01-06', 242.0)
('2021-01-07', 22.0)
('2021-01-08', 46.0)

### Question 3
Using Dataset C above, write a code with following requirements:
Your task is to create an automation (python script preferable) that convert JSON file above into three CSV files below:

CSV_1 :<br>
user_id,tx_id
<br>1,1
<br>1,3
<br>1,5
<br>2,2
<br>2,4
<br>2,6

CSV_2 :<br>
Id,name,email
<br>1,agus,agus@example.com
<br>2,asep,asep@example.com

CSV_3 :<br>
<br>Id,tx_date,tx_amount,tx_type
<br>1,2020-01-01,10,buy
<br>2,2020-01-01,10,sell
<br>3,2020-02-01,10,buy
<br>4,2020-02-01,10,sell
<br>5,2020-03-01,20,sell
<br>6,2020-03-01,20,buy

#### Import Library

In [27]:
import pandas as pd
import json

#### Load JSON Data

In [30]:
file=[
   {
       "user": {
           "id": 1,
           "name": "agus",
           "email": "agus@example.com"
       },
       "txs": [
           {
               "id": 1,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 3,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 5,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "sell"
           }
       ]
   },
   {
       "user": {
           "id": 2,
           "name": "asep",
           "email": "asep@example.com"
       },
       "txs": [
           {
               "id": 2,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 4,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 6,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "buy"
           }
       ]
   }
]

In [31]:
file_df=pd.json_normalize(file,'txs',[['user','id'],['user','name'],['user','email']])
file_df

   id     tx_date  tx_amount tx_type user.id user.name        user.email
0   1  2020-01-01         10     buy       1      agus  agus@example.com
1   3  2020-02-01         10     buy       1      agus  agus@example.com
2   5  2020-03-01         20    sell       1      agus  agus@example.com
3   2  2020-01-01         10    sell       2      asep  asep@example.com
4   4  2020-02-01         10    sell       2      asep  asep@example.com
5   6  2020-03-01         20     buy       2      asep  asep@example.com

#### CSV 1

In [38]:
csv1=file_df[['user.id','id']]
csv1.columns=['user_id','tx_id']
csv1.set_index('user_id',inplace=True)
csv1.to_csv('CSV_1.csv')

In [40]:
csv1

         tx_id
user_id
1            1
1            3
1            5
2            2
2            4
2            6

#### CSV 2

In [41]:
csv2=file_df[['user.id','user.name','user.email']].drop_duplicates()
csv2.columns=['Id','name','email']
csv2.set_index('Id',inplace=True)
csv2.to_csv('CSV_2.csv')

In [42]:
csv2

    name             email
Id
1   agus  agus@example.com
2   asep  asep@example.com

#### CSV 3

In [43]:
csv3=file_df[['id','tx_date','tx_amount','tx_type']].sort_values(by='id')
csv3.columns=['Id', 'tx_date', 'tx_amount', 'tx_type']
csv3.set_index('Id',inplace=True)
csv3.to_csv('CSV_3.csv')

In [44]:
csv3

       tx_date  tx_amount tx_type
Id
1   2020-01-01         10     buy
2   2020-01-01         10    sell
3   2020-02-01         10     buy
4   2020-02-01         10    sell
5   2020-03-01         20    sell
6   2020-03-01         20     buy